:PROPERTIES:
:ID:       ae2d42cf-21c4-45ff-9d52-6fb65e1ad7b6
:END:
#+TITLE: NixOS: ROCm Support
#+CATEGORY: slips
#+TAGS:  

* script

#+name: onnxruntimepkgs
#+begin_src emacs-lisp :results vector value
(list "hipcub"
      "hipfft"
      "hiprand"
      "hipsparse"
      ;; "rocblas"
      "rocprim"
      "rocrand"
      "rocthrust"
      "miopen"
      "roctracer")
;; "clr"
;; "hipblas"
;; "rccl"
;; "rocm-smi"
#+end_src

#+RESULTS: onnxruntimepkgs
| hipcub | hipfft | hiprand | hipsparse | rocblas | rocprim | rocrand | rocthrust | miopen | roctracer |

#+name: rocmtree
#+headers: :var pkgs=(list "rccl" "hipblas") pkgset="rocmPackages" treei="-I *.dat -I *.co -I *.hsaco"
#+begin_src shell :results output verbatim
# this works in babel params. i'm not sure why
# treei="-I *.xml -I *.dat -I *.co -I *.hsaco" # not this "-I '.xml'"

pkgset=${pkgset:+"$pkgset."}
echo nixpkgs#$pkgset${pkgs[0]}


for pkg in ${pkgs[@]}; do
#    p=$(nix shell nixpkgs#rocmPackages.$pkg --command /bin/sh -c 'echo $PATH )
    p=$(nix shell nixpkgs#$pkgset${pkg} --command env | grep -e '^PATH' | tr ":" "\n" | head -n1 | sed -E "s/\/bin//g")
    p=${p/PATH=/}
    echo "** $pkg: $p"
    echo -e "#+begin_verse\n"
    tree --noreport -l $treei $p
    echo -e "#+end_verse\n\n"
done

  #  +call: rocmtree(pkgs=onnxruntimepkgs, pkgset="rocmPackages") :results output raw
  #  +call: rocmtree(pkgs=(list "rocblas"), pkgset="rocmPackages")) :results output raw
#+end_src

#+call: rocmtree(pkgs=(list "rocm-toolchain"), pkgset="rocmPackages")) :results output raw

#+RESULTS:
nixpkgs#rocmPackages.rocm-toolchain


